GoalsApp_name/app/controllers/users_controller.rb

    def show
        # Params Explained
        # Path:/users/1  body: user: { username: “Henry” }
        # params: { id: 1, user: {username: “Henry” } }
        # user_params: { username: “Henry” }
        # ------
        # Path:/users/1  body: user: { username: “Henry”, extra_param: “blah”}
        # params: { id: 1, user: {username: “Henry”, extra_param: “blah”} }
        # user_params: { username: “Henry” }


        @user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 48], ["LIMIT", 1]]